# StructuralUsage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..StructuralUsage Property
FamilyInstance Class See Also
---
Provides the primary structural usage of the instance, such as brace, girder etc.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public StructuralInstanceUsage StructuralUsage { get; set; }
```

Visual Basic
---
```text
Public Property StructuralUsage As StructuralInstanceUsage
	Get
	Set
```

Visual C++
---
```text
public:
property StructuralInstanceUsage StructuralUsage {
	StructuralInstanceUsage get ();
	void set (StructuralInstanceUsage value);
}
```

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace